[
	{
		"name": "Alice Zhang",
		"title": "President",
		"description": "Kellogg is a truly diverse school with communities for everyone, and I made lifelong friends thanks to the clubs on campus. But as the year progressed, I found it harder to meet peers outside of my self-selected groups. There's so much to learn from each other's perspectives, backgrounds, and experiences that will help us navigate the world in a more compassionate and informed manner, but we only have two years to take advantage of this unique environment. I'm running because I want to help connect Kellogg's various communities during our final year and ensure this lasts beyond just our class.",
		"thumbnailPath": "alice.jpeg"
	},
	{
		"name": "Yvette Anguiano",
		"title": "EVP of Diversity, Equity, & Inclusion",
		"description": "2Y 2024",
		"thumbnailPath": "yvette.jpeg"
	},
	{
		"name": "Sam Elmer",
		"title": "VP of Academics",
		"description": "Academics have been an integral piece of my time at Kellogg. They can add a lot of value but can also add clutter and stress to the MBA experience, especially during the bidding process! I am committed to giving a voice to student’s opinions on academics as I interface with the administration and faculty.",
		"thumbnailPath": "sam.jpeg"
	},
	{
		"name": "Cassandra Esinaulo",
		"title": "VP of Careers",
		"description": "2Y 2024",
		"thumbnailPath": "cassandra.jpeg"
	},
	{
		"name": "Aaren Barge",
		"title": "VP of Clubs and Finance",
		"description": "2Y 2024",
		"thumbnailPath": "aaren.jpeg"
	},
	{
		"name": "Goro Suzuki",
		"title": "VP of Global Affairs",
		"description": "As a parent from another country, I encountered numerous struggles during my first year at Kellogg. My friends helped me overcome these challenges and encouraged me to step up more often – I aim to pay it forward by serving as a bridge between international and local students. Despite the diversity of the student body, we sometimes tend to remain in our own bubbles. By creating intentional opportunities for learning and engagement from one another, I envision Kellogg becoming a more inclusive community of international and local students that help each other grow into more empathetic and inclusive leaders.",
		"thumbnailPath": "goro.jpeg"
	},
	{
		"name": "Will Engellenner",
		"title": "VP of Personal & Professional Development",
		"description": "One of the best things about Kellogg is that we are constantly encouraged to bring our best selves – for classes, recruiting, student groups, our families, and even in social circles. While we're all ultimately here to better ourselves and our business acumen, frequent challenges have trade-offs and can take a toll on well-being. I'm running for KSA VP of Personal & Professional Development because I'm passionate about giving every student the resources they need to succeed at Kellogg, whether that means concrete skills-based training to succeed in coursework and recruiting, or coordinated resources to support overall mental well-being.",
		"thumbnailPath": "will.jpeg"
	},
	{
		"name": "Tanjeria Crite",
		"title": "VP of Social",
		"description": "MMM 2024",
		"thumbnailPath": "tangeria.jpeg"
	},
	{
		"name": "Ruta Patel",
		"title": "VP of Technology",
		"description": "As a first year director on KSA Tech, I had the opportunity to help lay the groundwork for multiple initiatives to enhance the student experience. I will continue to iterate on initiatives like Analytics for Inclusion to foster connections between students from different backgrounds and work with KIS to resolve gaps in technology tools. Technology is ubiquitous and as VP of Technology, I am passionate about improving how students leverage technology at Kellogg.",
		"thumbnailPath": "ruta.jpeg"
	}
]